app/views/posts/index.html.erb

  <% if params[:date] == "Today" %>
    <%= @posts = Post.where("created_at >=?", Time.zone.today.beginning_of_day) %>
---
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')